#include"ds1302.h"

#define SCLK PORTCbits.RC1
#define RST PORTCbits.RC3
#define DSIO PORTCbits.RC2
uchar READ_RTC_ADDR[7] = {0x81, 0x83, 0x85, 0x87, 0x89, 0x8b, 0x8d}; //读寄存器地址
uchar WRITE_RTC_ADDR[7] = {0x80, 0x82, 0x84, 0x86, 0x88, 0x8a, 0x8c};//写寄存器地址
uchar TIME[7] = {0, 0, 0x12, 0x01, 0x01, 0x04, 0x15};   //存放时间的数组

/*******************************************************************************
* 函数名            : delay_nms
* 函数功能		   : 延时n毫秒
* 输入              : n
* 输出              : 无
*******************************************************************************/
void delay_nms(unsigned int n)
{
	do{
		Delay1KTCYx(4);
	}while(--n);
}

/*******************************************************************************
* 函数名            : delay
* 函数功能		   : 延时函数
* 输入              : j
* 输出              : 无
*******************************************************************************/
void delay(int j)                
{
   unsigned char i;
  for(i=0;i<j;i++);
}
/*******************************************************************************
* 函数名            : ds1302write
* 函数功能		   : 像ds1302发送命令（地址+数据）
* 输入              : addr,dat
* 输出              : 无
*******************************************************************************/
void ds1302write(uchar addr,uchar dat)
{
    uchar n;
	SCLK=0;
	Nop();
	RST=1;
	Nop();
	for(n=0;n<8;n++)
	{
	  DSIO=addr&0x01;
      addr>>=1;
	  SCLK=1;
	  Nop();
	  SCLK=0;
	  Nop();
	}
    
	for(n=0;n<8;n++)
	{
	  DSIO=dat&0x01;
	  dat>>=1;
	  SCLK=1;
	  Nop();
	  SCLK=0;
	  Nop();
	}
	RST=0;
    Nop();
}
/*******************************************************************************
* 函数名            : ds1302read
* 函数功能		   : 读取一个地址的数据
* 输入              : addr
* 输出              : dat
*******************************************************************************/
uchar ds1302read(char addr)
{
    uchar n,dat,dat1;
    SCLK=0;
	Nop();
	RST=1;
	Nop();
	for(n=0;n<8;n++)
	{
	  DSIO=addr&0x01;
	  addr>>=1;
	  SCLK=1;
	  Nop();
	  SCLK=0;
	  Nop();
	}
	Nop();
    TRISC=0x04;
	for(n=0;n<8;n++)
	{
	  dat1=DSIO;
	  dat=(dat>>1)|(dat1<<7);
	  SCLK=1;
	  Nop();
	  SCLK=0;
	  Nop();
	}
     TRISC=0x00;
	 RST=0;
	 Nop();
	 SCLK=1;
	 Nop();
	 DSIO=0;
	 Nop();
	 DSIO=1;
	 Nop();
	 return dat;
}
/*******************************************************************************
* 函数名            : ds1302init
* 函数功能		   : 初始化ds1302
* 输入              : 无
* 输出              : 无
*******************************************************************************/
void ds1302init()
{
    uchar n;
    TRISC=0x00;
    ds1302write(0x8e,0x00);
	for(n=0;n<7;n++)
	{
	  ds1302write(WRITE_RTC_ADDR[n],TIME[n]);
	}
	ds1302write(0x8e,0x80);
}
/*******************************************************************************
* 函数名            : ds1302readtime
* 函数功能		   : 读取时钟信息
* 输入              : 无
* 输出              : 无
*******************************************************************************/
void ds1302readtime()
{
  uchar n;
  for(n=0;n<7;n++)
 { 
    TIME[n]=ds1302read(READ_RTC_ADDR[n]);
  }
}